###################################################################

# Created by write_sdc on Sun Dec  5 02:21:11 2021

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_driving_cell -lib_cell INVX1TS [get_ports {opcode[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {opcode[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports din_uni_a_sgn]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_exp[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_exp[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_exp[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_exp[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_exp[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_exp[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[21]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[20]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[19]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[18]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[17]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[16]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_a_man_dn[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports din_uni_b_sgn]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_exp[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_exp[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_exp[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_exp[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_exp[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_exp[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[21]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[20]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[19]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[18]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[17]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[16]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din_uni_b_man_dn[0]}]
set_load -pin_load 0.01 [get_ports dout_uni_y_sgn]
set_load -pin_load 0.01 [get_ports {dout_uni_y_exp[5]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_exp[4]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_exp[3]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_exp[2]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_exp[1]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_exp[0]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[21]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[20]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[19]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[18]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[17]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[16]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[15]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[14]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[13]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[12]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[11]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[10]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[9]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[8]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[7]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[6]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[5]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[4]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[3]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[2]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[1]}]
set_load -pin_load 0.01 [get_ports {dout_uni_y_man_dn[0]}]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports {opcode[1]}]
set_max_capacitance 0.005 [get_ports {opcode[0]}]
set_max_capacitance 0.005 [get_ports din_uni_a_sgn]
set_max_capacitance 0.005 [get_ports {din_uni_a_exp[5]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_exp[4]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_exp[3]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_exp[2]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_exp[1]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_exp[0]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[21]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[20]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[19]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[18]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[17]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[16]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[15]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[14]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[13]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[12]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[11]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[10]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[9]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[8]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[7]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[6]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[5]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[4]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[3]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[2]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[1]}]
set_max_capacitance 0.005 [get_ports {din_uni_a_man_dn[0]}]
set_max_capacitance 0.005 [get_ports din_uni_b_sgn]
set_max_capacitance 0.005 [get_ports {din_uni_b_exp[5]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_exp[4]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_exp[3]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_exp[2]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_exp[1]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_exp[0]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[21]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[20]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[19]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[18]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[17]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[16]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[15]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[14]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[13]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[12]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[11]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[10]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[9]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[8]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[7]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[6]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[5]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[4]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[3]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[2]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[1]}]
set_max_capacitance 0.005 [get_ports {din_uni_b_man_dn[0]}]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports {opcode[1]}]
set_max_fanout 4 [get_ports {opcode[0]}]
set_max_fanout 4 [get_ports din_uni_a_sgn]
set_max_fanout 4 [get_ports {din_uni_a_exp[5]}]
set_max_fanout 4 [get_ports {din_uni_a_exp[4]}]
set_max_fanout 4 [get_ports {din_uni_a_exp[3]}]
set_max_fanout 4 [get_ports {din_uni_a_exp[2]}]
set_max_fanout 4 [get_ports {din_uni_a_exp[1]}]
set_max_fanout 4 [get_ports {din_uni_a_exp[0]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[21]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[20]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[19]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[18]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[17]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[16]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[15]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[14]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[13]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[12]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[11]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[10]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[9]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[8]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[7]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[6]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[5]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[4]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[3]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[2]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[1]}]
set_max_fanout 4 [get_ports {din_uni_a_man_dn[0]}]
set_max_fanout 4 [get_ports din_uni_b_sgn]
set_max_fanout 4 [get_ports {din_uni_b_exp[5]}]
set_max_fanout 4 [get_ports {din_uni_b_exp[4]}]
set_max_fanout 4 [get_ports {din_uni_b_exp[3]}]
set_max_fanout 4 [get_ports {din_uni_b_exp[2]}]
set_max_fanout 4 [get_ports {din_uni_b_exp[1]}]
set_max_fanout 4 [get_ports {din_uni_b_exp[0]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[21]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[20]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[19]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[18]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[17]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[16]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[15]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[14]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[13]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[12]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[11]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[10]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[9]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[8]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[7]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[6]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[5]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[4]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[3]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[2]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[1]}]
set_max_fanout 4 [get_ports {din_uni_b_man_dn[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 390  -waveform {0 195}
set_clock_uncertainty 0  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0.05  [get_ports {opcode[1]}]
set_input_delay -clock clk  0.05  [get_ports {opcode[0]}]
set_input_delay -clock clk  0.05  [get_ports din_uni_a_sgn]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_exp[5]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_exp[4]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_exp[3]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_exp[2]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_exp[1]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_exp[0]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[21]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[20]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[19]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[18]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[17]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[16]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[15]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[14]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[13]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[12]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[11]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[10]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[9]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[8]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[7]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[6]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[5]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[4]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[3]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[2]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[1]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_a_man_dn[0]}]
set_input_delay -clock clk  0.05  [get_ports din_uni_b_sgn]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_exp[5]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_exp[4]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_exp[3]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_exp[2]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_exp[1]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_exp[0]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[21]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[20]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[19]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[18]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[17]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[16]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[15]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[14]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[13]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[12]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[11]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[10]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[9]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[8]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[7]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[6]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[5]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[4]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[3]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[2]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[1]}]
set_input_delay -clock clk  0.05  [get_ports {din_uni_b_man_dn[0]}]
set_output_delay -clock clk  100  [get_ports dout_uni_y_sgn]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_exp[5]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_exp[4]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_exp[3]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_exp[2]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_exp[1]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_exp[0]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[21]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[20]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[19]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[18]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[17]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[16]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[15]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[14]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[13]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[12]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[11]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[10]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[9]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[8]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[7]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[6]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[5]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[4]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[3]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[2]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[1]}]
set_output_delay -clock clk  100  [get_ports {dout_uni_y_man_dn[0]}]
