###################################################################

# Created by write_sdc on Mon Nov 29 12:23:29 2021

###################################################################
set sdc_version 1.7

set_units -time ns -resistance kOhm -capacitance pF -power mW -voltage V       \
-current mA
set_max_fanout 4 [current_design]
set_max_area 0
set_driving_cell -lib_cell INVX1TS [get_ports rst_n]
set_driving_cell -lib_cell INVX1TS [get_ports clk_slow]
set_driving_cell -lib_cell INVX1TS [get_ports clk]
set_driving_cell -lib_cell INVX1TS [get_ports {din[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {din[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports valid_in]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[16]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[15]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[14]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[13]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[12]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[11]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[10]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[9]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[8]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[7]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[6]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {cin[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[5]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[4]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[3]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[2]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[1]}]
set_driving_cell -lib_cell INVX1TS [get_ports {caddr[0]}]
set_driving_cell -lib_cell INVX1TS [get_ports cload]
set_load -pin_load 0.01 [get_ports {dout[15]}]
set_load -pin_load 0.01 [get_ports {dout[14]}]
set_load -pin_load 0.01 [get_ports {dout[13]}]
set_load -pin_load 0.01 [get_ports {dout[12]}]
set_load -pin_load 0.01 [get_ports {dout[11]}]
set_load -pin_load 0.01 [get_ports {dout[10]}]
set_load -pin_load 0.01 [get_ports {dout[9]}]
set_load -pin_load 0.01 [get_ports {dout[8]}]
set_load -pin_load 0.01 [get_ports {dout[7]}]
set_load -pin_load 0.01 [get_ports {dout[6]}]
set_load -pin_load 0.01 [get_ports {dout[5]}]
set_load -pin_load 0.01 [get_ports {dout[4]}]
set_load -pin_load 0.01 [get_ports {dout[3]}]
set_load -pin_load 0.01 [get_ports {dout[2]}]
set_load -pin_load 0.01 [get_ports {dout[1]}]
set_load -pin_load 0.01 [get_ports {dout[0]}]
set_load -pin_load 0.01 [get_ports valid]
set_load -pin_load 0.01 [get_ports {dout_29i[28]}]
set_load -pin_load 0.01 [get_ports {dout_29i[27]}]
set_load -pin_load 0.01 [get_ports {dout_29i[26]}]
set_load -pin_load 0.01 [get_ports {dout_29i[25]}]
set_load -pin_load 0.01 [get_ports {dout_29i[24]}]
set_load -pin_load 0.01 [get_ports {dout_29i[23]}]
set_load -pin_load 0.01 [get_ports {dout_29i[22]}]
set_load -pin_load 0.01 [get_ports {dout_29i[21]}]
set_load -pin_load 0.01 [get_ports {dout_29i[20]}]
set_load -pin_load 0.01 [get_ports {dout_29i[19]}]
set_load -pin_load 0.01 [get_ports {dout_29i[18]}]
set_load -pin_load 0.01 [get_ports {dout_29i[17]}]
set_load -pin_load 0.01 [get_ports {dout_29i[16]}]
set_load -pin_load 0.01 [get_ports {dout_29i[15]}]
set_load -pin_load 0.01 [get_ports {dout_29i[14]}]
set_load -pin_load 0.01 [get_ports {dout_29i[13]}]
set_load -pin_load 0.01 [get_ports {dout_29i[12]}]
set_load -pin_load 0.01 [get_ports {dout_29i[11]}]
set_load -pin_load 0.01 [get_ports {dout_29i[10]}]
set_load -pin_load 0.01 [get_ports {dout_29i[9]}]
set_load -pin_load 0.01 [get_ports {dout_29i[8]}]
set_load -pin_load 0.01 [get_ports {dout_29i[7]}]
set_load -pin_load 0.01 [get_ports {dout_29i[6]}]
set_load -pin_load 0.01 [get_ports {dout_29i[5]}]
set_load -pin_load 0.01 [get_ports {dout_29i[4]}]
set_load -pin_load 0.01 [get_ports {dout_29i[3]}]
set_load -pin_load 0.01 [get_ports {dout_29i[2]}]
set_load -pin_load 0.01 [get_ports {dout_29i[1]}]
set_load -pin_load 0.01 [get_ports {dout_29i[0]}]
set_max_capacitance 0.005 [get_ports rst_n]
set_max_capacitance 0.005 [get_ports clk_slow]
set_max_capacitance 0.005 [get_ports clk]
set_max_capacitance 0.005 [get_ports {din[15]}]
set_max_capacitance 0.005 [get_ports {din[14]}]
set_max_capacitance 0.005 [get_ports {din[13]}]
set_max_capacitance 0.005 [get_ports {din[12]}]
set_max_capacitance 0.005 [get_ports {din[11]}]
set_max_capacitance 0.005 [get_ports {din[10]}]
set_max_capacitance 0.005 [get_ports {din[9]}]
set_max_capacitance 0.005 [get_ports {din[8]}]
set_max_capacitance 0.005 [get_ports {din[7]}]
set_max_capacitance 0.005 [get_ports {din[6]}]
set_max_capacitance 0.005 [get_ports {din[5]}]
set_max_capacitance 0.005 [get_ports {din[4]}]
set_max_capacitance 0.005 [get_ports {din[3]}]
set_max_capacitance 0.005 [get_ports {din[2]}]
set_max_capacitance 0.005 [get_ports {din[1]}]
set_max_capacitance 0.005 [get_ports {din[0]}]
set_max_capacitance 0.005 [get_ports valid_in]
set_max_capacitance 0.005 [get_ports {cin[16]}]
set_max_capacitance 0.005 [get_ports {cin[15]}]
set_max_capacitance 0.005 [get_ports {cin[14]}]
set_max_capacitance 0.005 [get_ports {cin[13]}]
set_max_capacitance 0.005 [get_ports {cin[12]}]
set_max_capacitance 0.005 [get_ports {cin[11]}]
set_max_capacitance 0.005 [get_ports {cin[10]}]
set_max_capacitance 0.005 [get_ports {cin[9]}]
set_max_capacitance 0.005 [get_ports {cin[8]}]
set_max_capacitance 0.005 [get_ports {cin[7]}]
set_max_capacitance 0.005 [get_ports {cin[6]}]
set_max_capacitance 0.005 [get_ports {cin[5]}]
set_max_capacitance 0.005 [get_ports {cin[4]}]
set_max_capacitance 0.005 [get_ports {cin[3]}]
set_max_capacitance 0.005 [get_ports {cin[2]}]
set_max_capacitance 0.005 [get_ports {cin[1]}]
set_max_capacitance 0.005 [get_ports {cin[0]}]
set_max_capacitance 0.005 [get_ports {caddr[5]}]
set_max_capacitance 0.005 [get_ports {caddr[4]}]
set_max_capacitance 0.005 [get_ports {caddr[3]}]
set_max_capacitance 0.005 [get_ports {caddr[2]}]
set_max_capacitance 0.005 [get_ports {caddr[1]}]
set_max_capacitance 0.005 [get_ports {caddr[0]}]
set_max_capacitance 0.005 [get_ports cload]
set_max_fanout 4 [get_ports rst_n]
set_max_fanout 4 [get_ports clk_slow]
set_max_fanout 4 [get_ports clk]
set_max_fanout 4 [get_ports {din[15]}]
set_max_fanout 4 [get_ports {din[14]}]
set_max_fanout 4 [get_ports {din[13]}]
set_max_fanout 4 [get_ports {din[12]}]
set_max_fanout 4 [get_ports {din[11]}]
set_max_fanout 4 [get_ports {din[10]}]
set_max_fanout 4 [get_ports {din[9]}]
set_max_fanout 4 [get_ports {din[8]}]
set_max_fanout 4 [get_ports {din[7]}]
set_max_fanout 4 [get_ports {din[6]}]
set_max_fanout 4 [get_ports {din[5]}]
set_max_fanout 4 [get_ports {din[4]}]
set_max_fanout 4 [get_ports {din[3]}]
set_max_fanout 4 [get_ports {din[2]}]
set_max_fanout 4 [get_ports {din[1]}]
set_max_fanout 4 [get_ports {din[0]}]
set_max_fanout 4 [get_ports valid_in]
set_max_fanout 4 [get_ports {cin[16]}]
set_max_fanout 4 [get_ports {cin[15]}]
set_max_fanout 4 [get_ports {cin[14]}]
set_max_fanout 4 [get_ports {cin[13]}]
set_max_fanout 4 [get_ports {cin[12]}]
set_max_fanout 4 [get_ports {cin[11]}]
set_max_fanout 4 [get_ports {cin[10]}]
set_max_fanout 4 [get_ports {cin[9]}]
set_max_fanout 4 [get_ports {cin[8]}]
set_max_fanout 4 [get_ports {cin[7]}]
set_max_fanout 4 [get_ports {cin[6]}]
set_max_fanout 4 [get_ports {cin[5]}]
set_max_fanout 4 [get_ports {cin[4]}]
set_max_fanout 4 [get_ports {cin[3]}]
set_max_fanout 4 [get_ports {cin[2]}]
set_max_fanout 4 [get_ports {cin[1]}]
set_max_fanout 4 [get_ports {cin[0]}]
set_max_fanout 4 [get_ports {caddr[5]}]
set_max_fanout 4 [get_ports {caddr[4]}]
set_max_fanout 4 [get_ports {caddr[3]}]
set_max_fanout 4 [get_ports {caddr[2]}]
set_max_fanout 4 [get_ports {caddr[1]}]
set_max_fanout 4 [get_ports {caddr[0]}]
set_max_fanout 4 [get_ports cload]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 390  -waveform {0 195}
set_clock_uncertainty 0  [get_clocks clk]
set_clock_transition -max -rise 0.01 [get_clocks clk]
set_clock_transition -max -fall 0.01 [get_clocks clk]
set_clock_transition -min -rise 0.01 [get_clocks clk]
set_clock_transition -min -fall 0.01 [get_clocks clk]
set_input_delay -clock clk  0.05  [get_ports rst_n]
set_input_delay -clock clk  0.05  [get_ports clk_slow]
set_input_delay -clock clk  0.05  [get_ports {din[15]}]
set_input_delay -clock clk  0.05  [get_ports {din[14]}]
set_input_delay -clock clk  0.05  [get_ports {din[13]}]
set_input_delay -clock clk  0.05  [get_ports {din[12]}]
set_input_delay -clock clk  0.05  [get_ports {din[11]}]
set_input_delay -clock clk  0.05  [get_ports {din[10]}]
set_input_delay -clock clk  0.05  [get_ports {din[9]}]
set_input_delay -clock clk  0.05  [get_ports {din[8]}]
set_input_delay -clock clk  0.05  [get_ports {din[7]}]
set_input_delay -clock clk  0.05  [get_ports {din[6]}]
set_input_delay -clock clk  0.05  [get_ports {din[5]}]
set_input_delay -clock clk  0.05  [get_ports {din[4]}]
set_input_delay -clock clk  0.05  [get_ports {din[3]}]
set_input_delay -clock clk  0.05  [get_ports {din[2]}]
set_input_delay -clock clk  0.05  [get_ports {din[1]}]
set_input_delay -clock clk  0.05  [get_ports {din[0]}]
set_input_delay -clock clk  0.05  [get_ports valid_in]
set_input_delay -clock clk  0.05  [get_ports {cin[16]}]
set_input_delay -clock clk  0.05  [get_ports {cin[15]}]
set_input_delay -clock clk  0.05  [get_ports {cin[14]}]
set_input_delay -clock clk  0.05  [get_ports {cin[13]}]
set_input_delay -clock clk  0.05  [get_ports {cin[12]}]
set_input_delay -clock clk  0.05  [get_ports {cin[11]}]
set_input_delay -clock clk  0.05  [get_ports {cin[10]}]
set_input_delay -clock clk  0.05  [get_ports {cin[9]}]
set_input_delay -clock clk  0.05  [get_ports {cin[8]}]
set_input_delay -clock clk  0.05  [get_ports {cin[7]}]
set_input_delay -clock clk  0.05  [get_ports {cin[6]}]
set_input_delay -clock clk  0.05  [get_ports {cin[5]}]
set_input_delay -clock clk  0.05  [get_ports {cin[4]}]
set_input_delay -clock clk  0.05  [get_ports {cin[3]}]
set_input_delay -clock clk  0.05  [get_ports {cin[2]}]
set_input_delay -clock clk  0.05  [get_ports {cin[1]}]
set_input_delay -clock clk  0.05  [get_ports {cin[0]}]
set_input_delay -clock clk  0.05  [get_ports {caddr[5]}]
set_input_delay -clock clk  0.05  [get_ports {caddr[4]}]
set_input_delay -clock clk  0.05  [get_ports {caddr[3]}]
set_input_delay -clock clk  0.05  [get_ports {caddr[2]}]
set_input_delay -clock clk  0.05  [get_ports {caddr[1]}]
set_input_delay -clock clk  0.05  [get_ports {caddr[0]}]
set_input_delay -clock clk  0.05  [get_ports cload]
set_output_delay -clock clk  0.05  [get_ports {dout[15]}]
set_output_delay -clock clk  0.05  [get_ports {dout[14]}]
set_output_delay -clock clk  0.05  [get_ports {dout[13]}]
set_output_delay -clock clk  0.05  [get_ports {dout[12]}]
set_output_delay -clock clk  0.05  [get_ports {dout[11]}]
set_output_delay -clock clk  0.05  [get_ports {dout[10]}]
set_output_delay -clock clk  0.05  [get_ports {dout[9]}]
set_output_delay -clock clk  0.05  [get_ports {dout[8]}]
set_output_delay -clock clk  0.05  [get_ports {dout[7]}]
set_output_delay -clock clk  0.05  [get_ports {dout[6]}]
set_output_delay -clock clk  0.05  [get_ports {dout[5]}]
set_output_delay -clock clk  0.05  [get_ports {dout[4]}]
set_output_delay -clock clk  0.05  [get_ports {dout[3]}]
set_output_delay -clock clk  0.05  [get_ports {dout[2]}]
set_output_delay -clock clk  0.05  [get_ports {dout[1]}]
set_output_delay -clock clk  0.05  [get_ports {dout[0]}]
set_output_delay -clock clk  0.05  [get_ports valid]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[28]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[27]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[26]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[25]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[24]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[23]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[22]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[21]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[20]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[19]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[18]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[17]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[16]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[15]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[14]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[13]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[12]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[11]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[10]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[9]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[8]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[7]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[6]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[5]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[4]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[3]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[2]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[1]}]
set_output_delay -clock clk  0.05  [get_ports {dout_29i[0]}]
